{
    "instagram": {
        "label": {
            "instagram": "Instagram",
            "user": "Benutzer",
            "type": "Typ",
            "userphoto": "Benutzerfotos",
            "likedphoto": "Liked-Fotos",
            "output": "Ausgabe",
            "buffer": "Foto als ein Buffer",
            "url": "Foto-URL",
            "name": "Name",
            "create": "Eigene App erzeugen bei",
            "copy": "App-Details hierher kopieren",
            "clientid": "Client ID",
            "clientsecret": "Client Secret",
            "redirecturi": "Weiterleitungs-URI",
            "authenticate": "Bei Instagram authentifizieren",
            "instagramuser": "Instagram-Benutzer"
        },
        "placeholder": {
            "name": "Name"
        },
        "tip": {
            "redirect": "<p>Bitte bei Instagram einstellen, dass folgende <b>Weiterleitungs-URL</b> zur Authentifikation dieser App akzeptiert wird: </p>\n<code>__constructedURI__</code>"
        },
        "warn": {
            "image-not-sent": "Instagram-Node ist fehlgeschlagen beim Puffern eines Bildes. Bild wurde nicht gesendet.\n__error__\n__response__",
            "missing-accesstoken": "Fehlender Instagram-Access-Token. Authorisierung war nicht abgeschlossen vor der Node-Initialisierung.",
            "missing-configuration": "Fehlende Instagram-Konfiguration or -Berechtigung. Authorisierung war nicht abgeschlossen vor der Node-Initialisierung.",
            "userphoto-fetch-fail": "Instagram-Node ist fehlgeschlagen beim Abruf des letzten Benutzerfotos: __err__",
            "ignoring-media": "Die Instagram-API lieferte nicht alle erforderlichen Daten zur Erstellung der URL des Fotos, weswegen es ignoriert wird",
            "not-a-photo": "Das letzte Medium auf Instagram ist kein Foto, weswegen es ignoriert wird",
            "not-uploaded-yet": "Der Benutzer hat bislang keine Medien nach Instagram hochgeladen, weswegen keine Nutzdaten (Payload) gesendet wurden",
            "likedphoto-fetch-fail": "Instagram-Node ist fehlgeschlagen beim Abruf des letzten Liked-Foto: __err__",
            "not-liked-photo": "Das letzte Liked-Medium auf Instagram ist kein Foto, weswegen es ignoriert wird",
            "not-liked-yet": "Der Benutzer hat bislang keine Liked-Medien auf Instagram, weswegen keine Nutzdaten (Payload) gesendet wurden",
            "latest-media-fetch-failed": "Instagram-Node ist fehlgeschlagen beim Abruf des letzten Mediums: __err__",
            "media-fetch-failed": "Instagram-Node ist fehlgeschlagen beim Abruf irgendeines Mediums",
            "missing-credentials": "Fehlende Instagram-Berechtigungen"
        },
        "error": {
            "csrf-token-mismatch": "Keine Übereinstimmung des CSRF-Tokens, möglicherweise gefälschter Cross-Site-Anfrageversuch",
            "no-required-code": "Die Rückfrage von Instagram enthielt nicht den erforderlichen Code",
            "unexpected-statuscode": "Instagram antwortete mit einem unerwarteten HTTP-Status-Code von __statusCode__\nDetails:\n__data__",
            "request-error": "Anfragefehler:__err__",
            "oauth-error": "OAuth-Fehler: __error__",
            "no-ui-credentials": "FEHLER: Abfrage von Benutzeroberfläche (UI) ohne die benötigten Berechtigungen empfangen",
            "no-credentials": "FEHLER: Keine Berechtigungen - sollte niemals passieren",
            "username-fetch-fail": "FEHLER: Instagram-Node ist fehlgeschlagen beim Abruf des Benutzernamens",
            "accesstoken-fetch-fail": "FEHLER: Instagram-Node ist fehlgeschlagen beim Abruf eines gültigen Access-Tokens"
        },
        "message": {
            "authorized": "<html><head></head><body>Erfolgreich authorisiert bei Instagram. Dieses Fenster kann jetzt geschlossen werden.</body></html>"
        }
    }
}
